Revit 2024 API
IFCExtrusionCalculatorOptions Properties
The IFCExtrusionCalculatorOptions type exposes the following members.
Properties
Name | Description
CustomAxis
 The custom axis to try (if extrusionAxes includes an option for a custom direction).
ExtrusionAxes
 The extrusion axes to try when doing the calculation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Scale
 The scaling factor for length measurements from the default Revit units to the export units.
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace